project/Egypt/webservice interface20180517/ConcentratorAccess/req_GetEventDetail.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <ResourceURI xmlns="http://www.energiened.nl/Content/Publications/dsmr/P32">http://www.energiened.nl/Content/Publications/dsmr/P32/ metersDirectory</ResourceURI>
   </S:Header>
   <S:Body>
      <ns3:Create xmlns:ns5="http://www.energiened.nl/Content/Publications/dsmr/P32" xmlns:ns4="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:ns3="http://schemas.xmlsoap.org/ws/2006/08/resourceTransfer" xmlns:ns2="http://www.w3.org/2005/08/addressing" xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">

         <ns4:Metadata>
            <ns4:MetadataSection>
               <ns3:Metadata>
                  <ns3:Lifetime>
                     <ns3:TerminateAt>
<ns3:TerminationTime>2014-4-23T17:57:21-02:00</ns3:TerminationTime>
                     </ns3:TerminateAt>
                  </ns3:Lifetime>
               </ns3:Metadata>
            </ns4:MetadataSection>
         </ns4:Metadata>
         <ns3:Fragment>
            <ns3:Expression>p32:ConcentratorAccess</ns3:Expression>
            <ns3:Value>
               <ns5:ConcentratorAccess>
               	<ns5:ConcentratorService/>
               	<ns5:EventLog/>
               	<ns5:Status>
               		<ns5:Indent Value="GetEventDetail"  Password="000000"/>  
               		<!--Value=GetEventDetail means get detail of event，EventClassId is necessary(2 digit of HEX，is classid of event，include events in the class)-->
               		<ns5:Status>
	               		<ns5:SelectiveAccess>
		               		<EventClassId>02</EventClassId>  <!--2 class supported, 01--standard event, 02 security event -->
		               		<BeginTime>2016-11-14 13:30:01</BeginTime>  <!--time range is optional-->
		               		<EndTime>2016-11-14 15:30:01</EndTime>
	               		</ns5:SelectiveAccess>
               		</ns5:Status>
                  </ns5:Status>
               </ns5:ConcentratorAccess>
            </ns3:Value>
         </ns3:Fragment>
      </ns3:Create>
        </S:Body>
</S:Envelope>
